//=========================================================================
//  Nicsys1000   版本:  2.0
//-------------------------------------------------------------------------
//  
//  实时库的接口函数定义文件
//
//-------------------------------------------------------------------------
//  版权 (C) 2012 - 北京中核控制系统工程有限公司(CNCS)
//=========================================================================
// 
//  改动历史：
//  	1. 2012/02/27 : 	CNCS-0136 建立文件
//=========================================================================
#ifndef __Nicsys_API_H__
#define __Nicsys_API_H__
#include "nicDefs.h"
CDECL_BEGIN



//=========================================================================
// 
// 函数及参数列表结构体定义
// 
//=========================================================================

typedef struct  
{
	nicUInt8				InputParaCount;			/// 输入参数个数
	/// <summary> 
	///	从这之后为参数列表，见每个异步函数的函数及参数列表结构体定义
	/// </summary> 
}nicInputParaInfo;

typedef struct  
{
	nicUInt8				OutputParaCount;		/// 输出参数个数
	/// <summary> 
	///	从这之后为参数列表，见每个异步函数的函数及参数列表结构体定义
	/// </summary> 
}nicOutputParaInfo;

/// <summary> 
///	函数及参数列表结构体定义
/// </summary> 
/// <summary> 
///		异步调用返回时，参数列表保存返回结果
///		修改相应参数，并将该结构体传递给调用者处理。
///		不同的函数对应不同的函数及参数列表结构体，但它们的结构体头是相同的，
///		异步调用返回时，调用者应该根据需要自己转换。
/// </summary> 
typedef struct  
{
	nicUInt8				StructSize;			/// 结构体尺寸
	nicUInt16			FunctionId;			/// 函数ID号
	nicHandle 			hServer;			/// 服务器句柄
	nicAPIStatus			APIStatus;			/// 函数返回状态
	nicUInt8				OutputParaCount;		/// 输出参数个数
	/// <summary> 
	///	从这之后为参数列表，见每个异步函数的函数及参数列表结构体定义
	/// </summary> 
}nicFunctionInfo;


CDECL_END

#endif ///  __Nicsys_API_H__
